In [1]:
import pandas as pd

In [2]:
df_data = pd.read_csv('supermarket_sales.csv')

In [3]:
df_data.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [4]:
#Qual o faturamento total da filial?
df_data.groupby('City')[['Total', 'gross income']].sum()

                 Total  gross income
City
Mandalay   106197.6720     5057.0320
Naypyitaw  110568.7065     5265.1765
Yangon     106200.3705     5057.1605

In [5]:
#Qual a percentual de participação na receita de cada tipo de produto?
(df_data.groupby('Product line')['Total'].sum() / df_data.groupby('Product line')['Total'].sum().sum()).sort_values() * 100

Product line
Health and beauty         15.231828
Home and lifestyle        16.677232
Fashion accessories       16.814702
Electronic accessories    16.824497
Sports and travel         17.067648
Food and beverages        17.384094
Name: Total, dtype: float64

In [6]:
#Como está distribuído o tipo de produto consumido por gênero
df_data.groupby(['Product line', 'Gender'])[['Total']].sum().pivot_table(index='Product line', columns='Gender')

                             Total
Gender                      Female        Male
Product line
Electronic accessories  27102.0225  27235.5090
Fashion accessories     30437.4000  23868.4950
Food and beverages      33170.9175  22973.9265
Health and beauty       18560.9865  30632.7525
Home and lifestyle      30036.8775  23825.0355
Sports and travel       28574.7210  26548.1055

In [7]:
#Qual foi o faturamento por mês?
df_data['Date'] = pd.to_datetime(df_data['Date'])
df_data['Month'] = df_data['Date'].apply(lambda x: x.month)
df_data['Year'] = df_data['Date'].apply(lambda x: x.year)
df_data.groupby(['Month'])['Total'].sum()

Month
1    116291.868
2     97219.374
3    109455.507
Name: Total, dtype: float64

In [8]:
#Qual foi a média de avaliação por cada filial em janeiro de 2019
df_data[(df_data['Year'] == 2019) & (df_data['Month'] == 1)]['Rating'].mean()

np.float64(7.017613636363635)

In [9]:
#Como se distribui o gasto por tipo de consumidor em cada filial
df_data.groupby(['Customer type', 'City'])['Total'].sum()

Customer type  City
Member         Mandalay     53704.6860
               Naypyitaw    56881.2825
               Yangon       53637.4755
Normal         Mandalay     52492.9860
               Naypyitaw    53687.4240
               Yangon       52562.8950
Name: Total, dtype: float64

In [10]:
import numpy as np

In [11]:
labels = ['a', 'b', 'c']
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

In [12]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [ ]:
pd.Series(data=labels, index=minha_lista) #Poderia ter feito pd.Series(labels, minha_lista) que daria o mesmo resultado

10    a
20    b
30    c
dtype: object

In [14]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
ser1 = pd.Series([1,2,3,4],index=['EUA', 'Alemanha', 'Russia', 'Japão'])

In [18]:
ser1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [20]:
ser2 = pd.Series([1,2,5,4],index=['EUA', 'Alemanha', 'Italia', 'Japão'])
ser2

EUA         1
Alemanha    2
Italia      5
Japão       4
dtype: int64

In [21]:
ser1['EUA']

np.int64(1)

In [22]:
ser1[['Alemanha','Russia']]

Alemanha    2
Russia      3
dtype: int64

In [23]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
Russia      NaN
dtype: float64

###DataFrames

In [24]:
from numpy.random import randn

In [25]:
df = pd.DataFrame(randn(5,4), index=['A',"B",'C','D','E'], columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.833607  1.271731 -2.699065  1.076400
B  0.619865  0.764715  0.327158 -1.366056
C -0.819423 -0.851820 -0.170491  1.790641
D -1.979098 -0.614657  0.050214 -0.843822
E  1.752409  0.198005 -0.009185 -0.184181

In [26]:
df['W']

A    0.833607
B    0.619865
C   -0.819423
D   -1.979098
E    1.752409
Name: W, dtype: float64

In [27]:
df[['W']]

          W
A  0.833607
B  0.619865
C -0.819423
D -1.979098
E  1.752409

In [29]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.833607  1.271731 -2.699065  1.076400 -1.865459
B  0.619865  0.764715  0.327158 -1.366056  0.947023
C -0.819423 -0.851820 -0.170491  1.790641 -0.989914
D -1.979098 -0.614657  0.050214 -0.843822 -1.928884
E  1.752409  0.198005 -0.009185 -0.184181  1.743225

In [30]:
df.drop('new', axis=1) #ais = 1 corresponde a colunas e axis =0 linhas

          W         X         Y         Z
A  0.833607  1.271731 -2.699065  1.076400
B  0.619865  0.764715  0.327158 -1.366056
C -0.819423 -0.851820 -0.170491  1.790641
D -1.979098 -0.614657  0.050214 -0.843822
E  1.752409  0.198005 -0.009185 -0.184181

In [31]:
df

          W         X         Y         Z       new
A  0.833607  1.271731 -2.699065  1.076400 -1.865459
B  0.619865  0.764715  0.327158 -1.366056  0.947023
C -0.819423 -0.851820 -0.170491  1.790641 -0.989914
D -1.979098 -0.614657  0.050214 -0.843822 -1.928884
E  1.752409  0.198005 -0.009185 -0.184181  1.743225

In [32]:
df.drop('new', axis=1, inplace=True) #retira a coluna new do arquivo original

In [33]:
df

          W         X         Y         Z
A  0.833607  1.271731 -2.699065  1.076400
B  0.619865  0.764715  0.327158 -1.366056
C -0.819423 -0.851820 -0.170491  1.790641
D -1.979098 -0.614657  0.050214 -0.843822
E  1.752409  0.198005 -0.009185 -0.184181

In [34]:
df.loc['A']

W    0.833607
X    1.271731
Y   -2.699065
Z    1.076400
Name: A, dtype: float64

In [35]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  0.833607  1.271731 -2.699065  1.076400
B  0.619865  0.764715  0.327158 -1.366056

In [ ]:
df.iloc[0,2] #primeiro valor será a linha e o segundo a coluna para acessar uma célula da tabela

np.float64(-2.6990654198900583)